app/Http/Controllers/Api/PagesController.php

            ->where('item_status', Item::ITEM_PUBLISHED)
            ->with('state')
            ->with('city')
            // ->with('user')
            ->take(6)
            ->get()->map(function ($item) {
                $item->item_image = url('/storage/item/'.$item->item_image);
                return $item;
            });
---
select * from `cities`