app/Http/Controllers/Api/PagesController.php

select * from `categories` where `category_parent_id` is not null and `locale` = 'ar' order by `items_count` desc limit 6
---
    public function index(Request $request)
    {

        $settings = app('site_global_settings');
        $site_prefer_country_id = app('site_prefer_country_id');
        /**
         * first 6 categories order by total listings
         */
        $categories = Category::whereNotNull('category_parent_id')
            ->where('locale', $request->header('Accept-Language'))
            ->orderBy('items_count', 'desc')->take(6)->get();

select * from `cities` where `cities`.`id` in (618, 620, 626, 657, 715, 865, 1025, 1076)
select * from `states` where `states`.`id` in (10, 16, 618, 620, 626, 657, 715, 865)
---
            ->orderBy('created_at', 'DESC')
            ->with('state')
            ->with('city')
            // ->with('user')
            ->take(9)->get();

select * from `cities` where `cities`.`id` in (620, 626, 657, 715, 865)
select * from `items` where `locale` = 'ar' and (`items`.`country_id` = 1 or `items`.`country_id` is null) and `item_status` = 2 order by `created_at` desc limit 6
select * from `states` where `states`.`id` in (620, 626, 657, 715, 865)
---
        /**
         * get first 6 latest items
         */
        $latest_items = Item::latest('created_at')
            ->where('locale', $request->header('Accept-Language'))
            ->where(function ($query) use ($site_prefer_country_id) {
                $query->where('items.country_id', $site_prefer_country_id)
                    ->orWhereNull('items.country_id');
            })
            ->where('item_status', Item::ITEM_PUBLISHED)
            ->with('state')
            ->with('city')
            ->take(6)
            ->get();

select * from `blogs` order by `id` desc limit 3
select * from `states` where `locale` = 'ar' order by `state_name` asc limit 6
---
        /**
         * get latest 3 blog posts
         */
        $recent_blog = Blog::orderBy('id', 'desc')
            ->take(3)->get();

        $all_states = State::orderBy('state_name')
            ->where('locale', $request->header('Accept-Language'))
            ->take(6)
            ->get();