<?php

return array (
  'category-name-a-z' => 'الاسم AZ',
  'category-name-z-a' => 'الاسم ZA',
  'custom-field-name-a-z' => 'الاسم AZ',
  'custom-field-name-z-a' => 'الاسم ZA',
  'test-smtp' => 
  array (
    'email-body' => 'هذا بريد إلكتروني تجريبي للتحقق من وظائف SMTP. ما يلي هو نص فقرة تم إنشاؤه عشوائيًا.',
    'email-subject' => 'يرجى التحقق من هذا الاختبار لإرسال البريد الإلكتروني عبر SMTP',
    'enable-smtp-notify' => 'يرجى تمكين SMTP لمتابعة الاختبار.',
    'error-notify' => 'حدث خطأ أثناء إرسال البريد الإلكتروني التجريبي:',
    'modal' => 
    array (
      'modal-description' => 'سيتم إرسال بريد إلكتروني للاختبار إلى عنوان البريد الإلكتروني الذي أدخلته أدناه باستخدام إعداد SMTP الذي قدمته.',
      'modal-send' => 'ارسل الان',
      'modal-title' => 'اختبار إعداد SMTP',
    ),
    'receiver-email' => 'البريد الإلكتروني المتلقي',
    'send-a-test-email-link' => 'إرسال بريد إلكتروني تجريبي',
    'success-notify' => 'تم إرسال البريد الإلكتروني التجريبي بنجاح. يرجى التحقق من صندوق البريد الإلكتروني الخاص بك أو صندوق البريد العشوائي للتحقق. لمعلوماتك ، تم إرسال البريد الإلكتروني للاختبار إلى:',
  ),
);
