<?php

return array (
  'alert' => 
  array (
    'session-updated-success' => 'تم تحديث إعداد الجلسة بنجاح.',
  ),
  'edit' => 'إعداد الجلسة',
  'edit-desc' => 'تتيح لك هذه الصفحة تكوين جلسة موقع الويب',
  'seo' => 
  array (
    'edit-setting-session' => 'لوحة القيادة - تحرير الجلسة - :site_name',
  ),
  'session' => 'جلسة',
  'session-cookie' => 'بسكويت',
  'session-cookie-help' => 'ملفات تعريف الارتباط - يتم تخزين الجلسات في ملفات تعريف ارتباط آمنة ومشفرة.',
  'session-database' => 'قاعدة البيانات',
  'session-database-help' => 'قاعدة البيانات - يتم تخزين الجلسات في جدول الجلسات من قاعدة بيانات الموقع',
  'session-driver' => 'سائق الجلسة',
  'session-file' => 'ملف',
  'session-file-help' => 'ملف - يتم تخزين الجلسات في laravel_project / storage / framework / Session.',
  'session-intro-desc' => 'نظرًا لأن التطبيقات التي تعتمد على HTTP عديمة الحالة ، توفر الجلسات طريقة لتخزين معلومات حول المستخدم عبر طلبات متعددة. يدعم موقع الويب 3 طرق لتخزين معلومات الجلسة: ملف وملفات تعريف الارتباط وقاعدة البيانات. بغض النظر عن طريقة تخزين الجلسة ، يتم تشفير معلومات الجلسة.',
  'update-help' => 'تحتاج إلى تسجيل الدخول مرة أخرى بعد تحديث برنامج تشغيل الجلسة',
);
