app/Http/Controllers/PagesController.php

            ->where('locale', app()->getLocale())
            ->get();

        $search_bar_categories = Category::orderBy('category_name')
            ->select('category_name', 'category_slug', 'category_icon')
            ->where("category_name", "مطاعم")
            ->orWhere("category_name", "دكاتره")
            ->orWhere("category_name", "احتياجات")
            ->get();
---
select `category_name`, `category_slug`, `category_icon` from `categories` where `category_name` = 'مطاعم' or `category_name` = 'دكاتره' or `category_name` = 'احتياجات' order by `category_name` asc

         * first 6 categories order by total listings
         */
        $active_user_ids = $subscription_obj->getActiveUserIds();
        $categories = Category::withCount(['allItems' => function ($query) use ($active_user_ids, $site_prefer_country_id) {
            $query->whereIn('items.user_id', $active_user_ids)
                ->where('items.item_status', Item::ITEM_PUBLISHED)
                ->where(function ($query) use ($site_prefer_country_id) {
                    $query->where('items.country_id', $site_prefer_country_id)
                        ->orWhereNull('items.country_id');
                });
        }])
            ->where('category_parent_id', null)
            ->orderBy('all_items_count', 'desc')->take(6)->get();
---
select `categories`.*, (select count(*) from `items` inner join `category_item` on `items`.`id` = `category_item`.`item_id` where `categories`.`id` = `category_item`.`category_id` and `items`.`user_id` in (13, 21, 24, 20, 1) and `items`.`item_status` = 2 and (`items`.`country_id` = 1 or `items`.`country_id` is null)) as `all_items_count` from `categories` where `category_parent_id` is null order by `all_items_count` desc limit 6

    public function cities(Request $request, $state_slug)
    {
        $settings = app('site_global_settings');
        $site_prefer_country_id = app('site_prefer_country_id');
        $state = State::where('state_slug', $state_slug)->first();
        $search_keyword = $request->search_keyword;

        $all_cities = $state->cities()->orderBy('city_name','asc');
        if($search_keyword){
            $all_cities->where('city_name','like', '%' . $search_keyword . '%');
        }

        $all_cities = $all_cities->paginate(12);
---
select * from `states` where `state_slug` = 'القاهرة' limit 1
select * from `cities` where `cities`.`state_id` = 1 and `cities`.`state_id` is not null order by `city_name` asc limit 12 offset 0
select count(*) as aggregate from `cities` where `cities`.`state_id` = 1 and `cities`.`state_id` is not null

        /**
         * first 6 categories order by total listings
         */
        $search_categories = Category::orderBy('category_name')
            ->whereNull('category_parent_id')
            ->select('category_name', 'id', 'category_image', 'category_icon')
            ->where('locale', app()->getLocale())
            ->get();

        $categories = Category::orderBy('category_name')
            ->whereNotNull('category_parent_id')
            ->where('locale', app()->getLocale())
            ->get();


        $theme_view_path = Theme::find($settings->setting_site_active_theme_id);
---
select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc
select * from `categories` where `category_parent_id` is not null and `locale` = 'ar' order by `category_name` asc
select * from `themes` where `themes`.`id` = 1 limit 1

            ->where('items.item_title', 'like', '%' . $search_values . '%')
            ->orderBy('position')->orderBy('item_title');
        $active_user_ids = $subscription_obj->getActiveUserIds();
        $categories = Category::withCount(['allItems' => function ($query) use ($active_user_ids, $site_prefer_country_id) {
            $query->whereIn('items.user_id', $active_user_ids)
                ->where('items.item_status', Item::ITEM_PUBLISHED)
                ->where(function ($query) use ($site_prefer_country_id) {
                    $query->where('items.country_id', $site_prefer_country_id)
                        ->orWhereNull('items.country_id');
                });
        }])
            ->where('locale', app()->getLocale())
            ->where('category_parent_id', null)
            ->orderBy('all_items_count', 'desc')->take(5)->get();
---
select `categories`.*, (select count(*) from `items` inner join `category_item` on `items`.`id` = `category_item`.`item_id` where `categories`.`id` = `category_item`.`category_id` and `items`.`user_id` in (13, 21, 24, 20, 1) and `items`.`item_status` = 2 and (`items`.`country_id` = 1 or `items`.`country_id` is null)) as `all_items_count` from `categories` where `locale` = 'ar' and `category_parent_id` is null order by `all_items_count` desc limit 5

         */
        if(!$search_values && request()->routeIs('page.popular'))
        {
            $ads_before_content = Advertisement::where('advertisementable_id', Advertisement::AD_PLACE_LISTING_POPULAR_PAGE)
                ->where('advertisement_position', Advertisement::AD_POSITION_BEFORE_CONTENT)
                ->where('advertisement_status', Advertisement::AD_STATUS_ENABLE)
                ->get();
            $ads_after_content = Advertisement::where('advertisementable_id', Advertisement::AD_PLACE_LISTING_POPULAR_PAGE)
                ->where('advertisement_position', Advertisement::AD_POSITION_AFTER_CONTENT)
                ->where('advertisement_status', Advertisement::AD_STATUS_ENABLE)
                ->get();
---
select * from `advertisements` where `advertisementable_id` = 8 and `advertisement_position` = 2 and `advertisement_status` = 1
select * from `advertisements` where `advertisementable_id` = 8 and `advertisement_position` = 3 and `advertisement_status` = 1

         */
        $all_printable_categories = $category_obj->getPrintableCategoriesNoDash();

        $all_states = Country::find($site_prefer_country_id)
            ->states()
            ->where('locale', app()->getLocale())->orderBy('state_name')->get();
---
select * from `states` where `states`.`country_id` = 1 and `states`.`country_id` is not null and `locale` = 'ar' order by `state_name` asc

         * End initial filter
         */

        $search_categories = Category::orderBy('category_name')
            ->whereNull('category_parent_id')
            ->select('category_name', 'id', 'category_image', 'category_icon')
            ->where('locale', app()->getLocale())
            ->get();
---
select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc

         * first 6 categories order by total listings
         */

        $categories = Category::when($char, function ($query) use ($char) {
            // make sure `name` field is added index
            return $query->where('category_name', 'like', "{$char}%");
        })->when($search_keyword, function ($query) use ($search_keyword) {
            // make sure `name` field is added index
            return $query->where('category_name', 'like', "%{$search_keyword}%");
        })
            ->orderBy('category_name', 'asc')
            ->whereNull('category_parent_id')
            ->where('locale', app()->getLocale())->paginate(20);
---
select * from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc limit 20 offset 0
select count(*) as aggregate from `categories` where `category_parent_id` is null and `locale` = 'ar'

        /**
         * Start filter for paid listing
         */
        $index = Category::where('locale', app()->getLocale())
            ->selectRaw('substr(category_name,1,1) as letter')
            ->distinct()
            ->orderBy('letter')
            ->get()
            ->pluck('letter')
            ->toArray();
---
select distinct substr(category_name,1,1) as letter from `categories` where `locale` = 'ar' order by `letter` asc

        /**
         * Start initial blade view file path
         */
        $theme_view_path = Theme::find($settings->setting_site_active_theme_id);
---
select * from `themes` where `themes`.`id` = 1 limit 1

        /**
         * End initial blade view file path
         */
        $search_categories = Category::orderBy('category_name')
            ->whereNull('category_parent_id')
            ->select('category_name', 'id', 'category_image', 'category_icon')
            ->where('locale', app()->getLocale())
            ->get();
---
select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc

    public function category(Request $request, string $parent_category_slug, string $category_slug)
    {
        $category = Category::where('category_slug', $category_slug)->first();
---
select * from `categories` where `category_slug` = 'مراتب' limit 1




            $all_states = Country::find($site_prefer_country_id)
                ->states()
                ->where('locale', app()->getLocale())
                ->orderBy('state_name')->get();
---
select * from `states` where `states`.`country_id` = 1 and `states`.`country_id` is not null and `locale` = 'ar' order by `state_name` asc

            /**
             * Start initial blade view file path
             */
            $theme_view_path = Theme::find($settings->setting_site_active_theme_id);
---
select * from `themes` where `themes`.`id` = 1 limit 1

             * End initial blade view file path
             */

            $search_categories = Category::orderBy('category_name')
                ->whereNull('category_parent_id')
                ->select('category_name', 'id', 'category_image', 'category_icon')
                ->where('locale', app()->getLocale())
                ->get();
---
select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc

    public function city(Request $request, string $state_slug, string $city_slug)
    {
        $state = State::where('state_slug', $state_slug)->first();

        if ($state) {
            $city = $state->cities()->where('city_slug', $city_slug)->first();
---
select * from `states` where `state_slug` = 'القاهرة' limit 1
select * from `cities` where `cities`.`state_id` = 1 and `cities`.`state_id` is not null and `city_slug` = 'مدينة-نصر' limit 1

                    ->with('state')
                    ->with('city');

                $total_free_items = $free_items_query->count();
---
select * from `cities` where `cities`.`id` in (876)

                $active_user_ids = $subscription_obj->getActiveUserIds();

                $item_select_city_query = Item::query()->where('locale', app()->getLocale());
                $item_select_city_query->select('items.city_id')
                    ->where("items.item_status", Item::ITEM_PUBLISHED)
                    ->where('items.country_id', $site_prefer_country_id)
                    ->where("items.state_id", $state->id)
                    ->whereIn('items.user_id', $active_user_ids)
                    ->groupBy('items.city_id')
                    ->with('city');

                $all_item_cities = $item_select_city_query->get();
                $search_categories = Category::orderBy('category_name')
                    ->whereNull('category_parent_id')
                    ->select('category_name', 'id', 'category_image', 'category_icon')
                    ->where('locale', app()->getLocale())
                    ->get();
---
select `items`.`city_id` from `items` where `locale` = 'ar' and `items`.`item_status` = 2 and `items`.`country_id` = 1 and `items`.`state_id` = 1 and `items`.`user_id` in (13, 21, 24, 20, 1) group by `items`.`city_id`
select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc

                /**
                 * Start initial blade view file path
                 */
                $theme_view_path = Theme::find($settings->setting_site_active_theme_id);
---
select * from `themes` where `themes`.`id` = 1 limit 1

    public function getSubCategories(Request $request)
    {
        $categories = Category::where('category_parent_id', $request->category_id)->get();
---
select * from `categories` where `category_parent_id` = '64901'