app/Http/Controllers/PagesController.php

select `categories`.*, (select count(*) from `items` inner join `category_item` on `items`.`id` = `category_item`.`item_id` where `categories`.`id` = `category_item`.`category_id`) as `all_items_count` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `all_items_count` desc limit 8
select * from `categories` where `category_parent_id` is not null and `locale` = 'ar' order by RAND() limit 5
select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc
select `category_name`, `category_slug`, `category_icon` from `categories` where `category_name` = 'مطاعم' or `category_name` = 'دكاترة' or `category_name` = 'مستلزمات طبية' or `category_name` = 'احتياجات' order by `category_name` asc
---
         * first 6 categories order by total listings
         */
        $active_user_ids = $subscription_obj->getActiveUserIds();
        $categories = Category::withCount('allItems')
            ->where('category_parent_id', null)
            ->where('locale', app()->getLocale())
            ->orderBy('all_items_count', 'desc')
            ->take(8)->get();

        $recent_categories = Category::whereNotNull('category_parent_id')
            ->where('locale', app()->getLocale())
            ->inRandomOrder()->take(5)->get();

        $search_categories = Category::orderBy('category_name')
            ->whereNull('category_parent_id')
            ->select('category_name', 'id', 'category_image', 'category_icon')
            ->where('locale', app()->getLocale())
            ->get();

        $search_bar_categories = Category::orderBy('category_name')
            ->select('category_name', 'category_slug', 'category_icon')
            ->where("category_name", "مطاعم")
            ->orWhere("category_name", "دكاترة")
            ->orWhere("category_name", "مستلزمات طبية")
            ->orWhere("category_name", "احتياجات")
            ->get();

select * from `items` where `locale` = 'ar' and `item_image` is not null order by `item_featured` desc
---
        }


        $popular_items = Item::where('locale', app()->getLocale())
            ->orderBy('item_featured', 'DESC')
            ->whereNotNull('item_image')
            ->get()->take(10);

select * from `states` where `locale` = 'ar' order by `id` asc limit 5
select * from `cities`
---
                });
        }])
            ->*/
        $all_states = State::where('locale', app()->getLocale())
            ->orderBy('id', 'asc')->take(5)->get();

        $search_cities = City::all();

select * from `blogs` order by `id` desc, RAND() limit 4
select * from `advertisements` where `advertisementable_id` = 'home' and `advertisement_position` = 4 and `advertisement_status` = 1
select * from `advertisements` where `advertisementable_id` = 'home' and `advertisement_position` = 5 and `advertisement_status` = 1
select * from `advertisements` where `advertisementable_id` = 'home' and `advertisement_position` = 2 and `advertisement_status` = 1
select * from `advertisements` where `advertisementable_id` = 'home' and `advertisement_position` = 3 and `advertisement_status` = 1
---
        /**
         * get latest 3 blog posts
         */
        $recent_blog = Blog::orderByDesc('id')
            ->inRandomOrder()->take(4)->get();


        $ads_side_before_states = Advertisement::where('advertisementable_id', 'home')
            ->where('advertisement_position', Advertisement::AD_POSITION_SIDEBAR_BEFORE_CONTENT)
            ->where('advertisement_status', Advertisement::AD_STATUS_ENABLE)
            ->get();

        $ads_side_after_states = Advertisement::where('advertisementable_id', 'home')
            ->where('advertisement_position', Advertisement::AD_POSITION_SIDEBAR_AFTER_CONTENT)
            ->where('advertisement_status', Advertisement::AD_STATUS_ENABLE)
            ->get();

        $ads_after_states = Advertisement::where('advertisementable_id', 'home')
            ->where('advertisement_position', Advertisement::AD_POSITION_BEFORE_CONTENT)
            ->where('advertisement_status', Advertisement::AD_STATUS_ENABLE)
            ->get();

        $ads_after_lisitng = Advertisement::where('advertisementable_id', 'home')
            ->where('advertisement_position', Advertisement::AD_POSITION_AFTER_CONTENT)
            ->where('advertisement_status', Advertisement::AD_STATUS_ENABLE)
            ->get();

select * from `themes` where `themes`.`id` = 1 limit 1
---
        /**
         * Start initial blade view file path
         */
        $theme_view_path = Theme::find($settings->setting_site_active_theme_id);

select * from `states` where `states`.`country_id` = 1 and `states`.`country_id` is not null and `states`.`locale` = 'ar' order by `id` asc limit 8 offset 0
select count(*) as aggregate from `states` where `states`.`country_id` = 1 and `states`.`country_id` is not null and `states`.`locale` = 'ar'
---
    public function states()
    {
        $settings = app('site_global_settings');
        $site_prefer_country_id = app('site_prefer_country_id');
        $all_states = Country::find($site_prefer_country_id)
            ->states()
            ->orderBy('id', 'asc')
            ->where('states.locale', app()->getLocale())
            ->paginate(8);

select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc
select * from `themes` where `themes`.`id` = 1 limit 1
---
    public function cities(Request $request, $state_slug)
    {
        $settings = app('site_global_settings');
        $site_prefer_country_id = app('site_prefer_country_id');
        $state = State::where('state_slug', $state_slug)->first();
        $all_cities = $state->cities()->paginate(10);

        /**
         * first 6 categories order by total listings
         */
        $search_categories = Category::orderBy('category_name')
            ->whereNull('category_parent_id')
            ->select('category_name', 'id', 'category_image', 'category_icon')
            ->where('locale', app()->getLocale())
            ->get();

        $categories = Category::orderBy('category_name')
            ->whereNotNull('category_parent_id')
            ->where('locale', app()->getLocale())
            ->get();


        $theme_view_path = Theme::find($settings->setting_site_active_theme_id);

select * from `categories` where `categories`.`id` = '64901' limit 1
---
        $search_state = empty($request->search_state) ? null : $request->search_state;

        if ($search_category) {
            $category = Category::find($search_category);

select * from `categories` where `categories`.`id` = '1' limit 1
---
                $item_ids += $category->getItemIdsByCategoryIds();
        }
        if ($search_category_2) {
            $category2 = Category::find($search_category_2);

select `categories`.*, (select count(*) from `items` inner join `category_item` on `items`.`id` = `category_item`.`item_id` where `categories`.`id` = `category_item`.`category_id` and `items`.`user_id` in (13, 21, 24, 20, 1) and `items`.`item_status` = 2 and (`items`.`country_id` = 1 or `items`.`country_id` is null)) as `all_items_count` from `categories` where `locale` = 'ar' and `category_parent_id` is null order by `all_items_count` desc limit 5
---
            ->where('items.item_title', 'like', '%' . $search_values . '%')
            ->orderBy('position')->orderBy('item_title');
        $active_user_ids = $subscription_obj->getActiveUserIds();
        $categories = Category::withCount(['allItems' => function ($query) use ($active_user_ids, $site_prefer_country_id) {
            $query->whereIn('items.user_id', $active_user_ids)
                ->where('items.item_status', Item::ITEM_PUBLISHED)
                ->where(function ($query) use ($site_prefer_country_id) {
                    $query->where('items.country_id', $site_prefer_country_id)
                        ->orWhereNull('items.country_id');
                });
        }])
            ->where('locale', app()->getLocale())
            ->where('category_parent_id', null)
            ->orderBy('all_items_count', 'desc')->take(5)->get();

select * from `states` where `state_name` = 'القاهرة' limit 1
select * from `cities` where `city_name` = 'القاهرة' limit 1
---
            });
        // filter paid listings state
        if ($filter_city_state) {
            $state = State::where('state_name', $filter_city_state)->first();
            $city = City::where('city_name', $filter_city_state)->first();

select * from `advertisements` where `advertisementable_id` = 2 and `advertisement_position` = 2 and `advertisement_status` = 1
select * from `advertisements` where `advertisementable_id` = 2 and `advertisement_position` = 3 and `advertisement_status` = 1
---
                ->where('advertisement_position', Advertisement::AD_POSITION_BEFORE_CONTENT)
                ->where('advertisement_status', Advertisement::AD_STATUS_ENABLE)
                ->get();
            $ads_after_content = Advertisement::where('advertisementable_id', Advertisement::AD_PLACE_LISTING_POPULAR_PAGE)
                ->where('advertisement_position', Advertisement::AD_POSITION_AFTER_CONTENT)
                ->where('advertisement_status', Advertisement::AD_STATUS_ENABLE)
                ->get();
        }
        else{
            $ads_before_content = Advertisement::where('advertisementable_id', Advertisement::AD_PLACE_LISTING_SEARCH_PAGE)
                ->where('advertisement_position', Advertisement::AD_POSITION_BEFORE_CONTENT)
                ->where('advertisement_status', Advertisement::AD_STATUS_ENABLE)
                ->get();
            $ads_after_content = Advertisement::where('advertisementable_id', Advertisement::AD_PLACE_LISTING_SEARCH_PAGE)
                ->where('advertisement_position', Advertisement::AD_POSITION_AFTER_CONTENT)
                ->where('advertisement_status', Advertisement::AD_STATUS_ENABLE)
                ->get();

select * from `states` where `states`.`country_id` = 1 and `states`.`country_id` is not null and `locale` = 'ar' order by `state_name` asc
---
         */
        $all_printable_categories = $category_obj->getPrintableCategoriesNoDash();

        $all_states = Country::find($site_prefer_country_id)
            ->states()
            ->where('locale', app()->getLocale())->orderBy('state_name')->get();

select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc
---
         * End initial filter
         */

        $search_categories = Category::orderBy('category_name')
            ->whereNull('category_parent_id')
            ->select('category_name', 'id', 'category_image', 'category_icon')
            ->where('locale', app()->getLocale())
            ->get();

select * from `themes` where `themes`.`id` = 1 limit 1
---
        /**
         * Start initial blade view file path
         */
        $theme_view_path = Theme::find($settings->setting_site_active_theme_id);

select * from `items` where `items`.`user_id` = 1 and `items`.`user_id` is not null and `item_status` = 2 limit 10 offset 0
select count(*) as aggregate from `items` where `items`.`user_id` = 1 and `items`.`user_id` is not null and `item_status` = 2
select * from `themes` where `themes`.`id` = 1 limit 1
---
    public function branches(Request $request, User $user)
    {
        $free_items = $user->items()->where('item_status', Item::ITEM_PUBLISHED)->paginate(10);


        $settings = app('site_global_settings');
        $theme_view_path = Theme::find($settings->setting_site_active_theme_id);

select * from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc limit 20 offset 0
select count(*) as aggregate from `categories` where `category_parent_id` is null and `locale` = 'ar'
---
    public function categories(Request $request)
    {
        $settings = app('site_global_settings');
        $site_prefer_country_id = app('site_prefer_country_id');

        /**
         * Start SEO
         */
        SEOMeta::setTitle(__('seo.frontend.categories', ['site_name' => empty($settings->setting_site_name) ? config('app.name', 'Laravel') : $settings->setting_site_name]));
        SEOMeta::setDescription('');
        SEOMeta::setCanonical(request()->fullUrl()                                                                          );
        SEOMeta::addKeyword($settings->setting_site_seo_home_keywords);
        /**
         * End SEO
         */
        $char = $request->char ?? null;
        $search_keyword = $request->search_keyword ?? null;


        /**
         * first 6 categories order by total listings
         */

        $categories = Category::when($char, function ($query) use ($char) {
            // make sure `name` field is added index
            return $query->where('category_name', 'like', "{$char}%");
        })->when($search_keyword, function ($query) use ($search_keyword) {
            // make sure `name` field is added index
            return $query->where('category_name', 'like', "%{$search_keyword}%");
        })
            ->orderBy('category_name', 'asc')
            ->whereNull('category_parent_id')
            ->where('locale', app()->getLocale())->paginate(20);

select distinct substr(category_name,1,1) as letter from `categories` where `locale` = 'ar' order by `letter` asc
---
        /**
         * Start filter for paid listing
         */
        $index = Category::where('locale', app()->getLocale())
            ->selectRaw('substr(category_name,1,1) as letter')
            ->distinct()
            ->orderBy('letter')
            ->get()
            ->pluck('letter')
            ->toArray();

select * from `themes` where `themes`.`id` = 1 limit 1
---
        /**
         * Start initial blade view file path
         */
        $theme_view_path = Theme::find($settings->setting_site_active_theme_id);

select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc
---
        /**
         * End initial blade view file path
         */
        $search_categories = Category::orderBy('category_name')
            ->whereNull('category_parent_id')
            ->select('category_name', 'id', 'category_image', 'category_icon')
            ->where('locale', app()->getLocale())
            ->get();

select * from `categories` where `category_slug` = 'امواس-وشفرات' limit 1
---
    public function category(Request $request, string $parent_category_slug, string $category_slug)
    {
        $category = Category::where('category_slug', $category_slug)->first();

select * from `states` where `states`.`country_id` = 1 and `states`.`country_id` is not null and `locale` = 'ar' order by `state_name` asc
---
            /**
             * Start initial filter
             */
            $all_states = Country::find($site_prefer_country_id)
                ->states()
                ->where('locale', app()->getLocale())
                ->orderBy('state_name')->get();

select * from `themes` where `themes`.`id` = 1 limit 1
---
            /**
             * Start initial blade view file path
             */
            $theme_view_path = Theme::find($settings->setting_site_active_theme_id);

select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc
---
             * End initial blade view file path
             */

            $search_categories = Category::orderBy('category_name')
                ->whereNull('category_parent_id')
                ->select('category_name', 'id', 'category_image', 'category_icon')
                ->where('locale', app()->getLocale())
                ->get();

select * from `countries` where `countries`.`id` = 1 limit 1
---
                $paid_items_query->whereIn('id', $item_ids);
            }

            $paid_items_query->where("items.item_status", Item::ITEM_PUBLISHED)
                ->where('items.country_id', $site_prefer_country_id)
                ->where('items.state_id', $state->id)
                ->where('items.item_featured', Item::ITEM_FEATURED)
                ->where(function ($query) use ($paid_user_ids) {

                    $query->whereIn('items.user_id', $paid_user_ids)
                        ->orWhere('items.item_featured_by_admin', Item::ITEM_FEATURED_BY_ADMIN);
                });

select * from `states` where `state_slug` = 'القاهرة' limit 1
select * from `cities` where `cities`.`state_id` = 1 and `cities`.`state_id` is not null and `city_slug` = 'حلوان' limit 1
---
    public function city(Request $request, string $state_slug, string $city_slug)
    {
        $state = State::where('state_slug', $state_slug)->first();

        if ($state) {
            $city = $state->cities()->where('city_slug', $city_slug)->first();

select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is not null and `locale` = 'ar' order by `category_name` asc
---
                 * Start filter for paid listing
                 */
                // categories
                $filter_categories = Category::orderBy('category_name')
                    ->whereNotNull('category_parent_id')
                    ->select('category_name', 'id', 'category_image', 'category_icon')
                    ->where('locale', app()->getLocale())
                    ->get();;

select * from `cities` where `cities`.`id` in (1018)
---
                    ->with('state')
                    ->with('city');

                $total_free_items = $free_items_query->count();

select `items`.`city_id` from `items` where `locale` = 'ar' and `items`.`item_status` = 2 and `items`.`country_id` = 1 and `items`.`state_id` = 3 and `items`.`user_id` in (13, 21, 24, 20, 1) group by `items`.`city_id`
select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is not null and `locale` = 'ar' order by `category_name` asc
---
                $active_user_ids = $subscription_obj->getActiveUserIds();

                $item_select_city_query = Item::query()->where('locale', app()->getLocale());
                $item_select_city_query->select('items.city_id')
                    ->where("items.item_status", Item::ITEM_PUBLISHED)
                    ->where('items.country_id', $site_prefer_country_id)
                    ->where("items.state_id", $state->id)
                    ->whereIn('items.user_id', $active_user_ids)
                    ->groupBy('items.city_id')
                    ->with('city');

                $all_item_cities = $item_select_city_query->get();
                $search_categories = Category::orderBy('category_name')
                    ->whereNull('category_parent_id')
                    ->select('category_name', 'id', 'category_image', 'category_icon')
                    ->where('locale', app()->getLocale())
                    ->get();

select * from `themes` where `themes`.`id` = 1 limit 1
---
                /**
                 * Start initial blade view file path
                 */
                $theme_view_path = Theme::find($settings->setting_site_active_theme_id);

select * from `items` where `item_slug` = 'dssssssssssss-656dc1817816f' and `item_status` = 2 limit 1
select * from `users` where `users`.`id` = 1 limit 1
---
    public function item(Request $request, string $category_slug, string $sub_category_slug,
                         string  $state_slug, string $item_slug)
    {
        $settings = app('site_global_settings');
        $item = Item::where('item_slug', $item_slug)
            ->where('item_status', Item::ITEM_PUBLISHED)
            ->first();
        if ($item) {
            $item_user = $item->user()->first() ?? Auth::user();

select * from `item_features` where `item_features`.`item_id` = 908179 and `item_features`.`item_id` is not null and `item_feature_value` <> '' and `item_feature_value` is not null order by `id` asc
---
            /**
             * Start initla item features
             */
            $item_features = $item->features()->where('item_feature_value', '<>', '')
                ->whereNotNull('item_feature_value')
                ->get();

select * from `item_hours` where `item_hours`.`item_id` = 908179 and `item_hours`.`item_id` is not null
---
            $opening_hours_array_sunday = array();
            $opening_hour_exceptions_array = array();

            $item_hours = $item->itemHours()->get();

select * from `item_hour_exceptions` where `item_hour_exceptions`.`item_id` = 908179 and `item_hour_exceptions`.`item_id` is not null
---
                }
            }

            $item_hour_exceptions = $item->itemHourExceptions()->get();

select * from `cities` where `cities`.`id` in (653, 693, 823, 1076)
select * from `states` where `states`.`id` in (8, 11, 14, 16)
select * from `users` where `users`.`id` in (1)
select items.*, ( 6367 * acos( cos( radians( '29.9762977' ) ) * cos( radians( item_lat ) ) * cos( radians( item_lng ) - radians( '31.3731408' ) ) + sin( radians( '29.9762977' ) ) * sin( radians( item_lat ) ) ) ) AS distance from `items` where `id` != 908179 and `item_status` = 2 and `item_type` = 1 order by `distance` asc limit 4
---
            $longitude = $item->item_lng;
            $nearby_items = null;
            /*
                        $nearby_items = Item::selectRaw('items.*, ( 6367 * acos( cos( radians( ? ) ) * cos( radians( item_lat ) ) * cos( radians( item_lng ) - radians( ? ) ) + sin( radians( ? ) ) * sin( radians( item_lat ) ) ) ) AS distance', [$latitude, $longitude, $latitude])
                            ->where('id', '!=', $item->id)
                            ->where('item_status', Item::ITEM_PUBLISHED)
                            ->where('item_type', Item::ITEM_TYPE_REGULAR)
                            ->orderBy('distance', 'ASC')
                            ->with('state')
                            ->with('city')
                            ->with('user')
                            ->take(4)->get();*/

select distinct * from `items` where `items`.`id` in (908178, 908179) and `items`.`id` != 908179 and `items`.`item_status` = 2 order by RAND() limit 4
---
                $similar_item_ids = array_slice($similar_item_ids, rand(0, $similar_item_ids_length - Item::ITEM_SIMILAR_SHOW_MAX), Item::ITEM_SIMILAR_SHOW_MAX);
            }

            $similar_items = Item::whereIn('items.id', $similar_item_ids)
                ->where('items.id', '!=', $item->id)
                ->where('items.item_status', Item::ITEM_PUBLISHED)
                ->distinct('items.id')
                ->inRandomOrder()
                ->limit(Item::ITEM_SIMILAR_SHOW_MAX)
                ->get();

select * from `item_sections` where `item_sections`.`item_id` = 908179 and `item_sections`.`item_id` is not null and `item_section_position` = 3 and `item_section_status` = 2 order by `item_section_order` asc
select * from `item_sections` where `item_sections`.`item_id` = 908179 and `item_sections`.`item_id` is not null and `item_section_position` = 4 and `item_section_status` = 2 order by `item_section_order` asc
select * from `item_sections` where `item_sections`.`item_id` = 908179 and `item_sections`.`item_id` is not null and `item_section_position` = 5 and `item_section_status` = 2 order by `item_section_order` asc
select * from `item_sections` where `item_sections`.`item_id` = 908179 and `item_sections`.`item_id` is not null and `item_section_position` = 6 and `item_section_status` = 2 order by `item_section_order` asc
select * from `item_sections` where `item_sections`.`item_id` = 908179 and `item_sections`.`item_id` is not null and `item_section_position` = 7 and `item_section_status` = 2 order by `item_section_order` asc
select * from `item_sections` where `item_sections`.`item_id` = 908179 and `item_sections`.`item_id` is not null and `item_section_position` = 8 and `item_section_status` = 2 order by `item_section_order` asc
---
            /**
             * Start fetch item sections
             */
            $item_sections_after_breadcrumb = $item->itemSections()
                ->where('item_section_position', ItemSection::POSITION_AFTER_BREADCRUMB)
                ->where('item_section_status', ItemSection::STATUS_PUBLISHED)
                ->orderBy('item_section_order')
                ->get();

            $item_sections_after_gallery = $item->itemSections()
                ->where('item_section_position', ItemSection::POSITION_AFTER_GALLERY)
                ->where('item_section_status', ItemSection::STATUS_PUBLISHED)
                ->orderBy('item_section_order')
                ->get();

            $item_sections_after_description = $item->itemSections()
                ->where('item_section_position', ItemSection::POSITION_AFTER_DESCRIPTION)
                ->where('item_section_status', ItemSection::STATUS_PUBLISHED)
                ->orderBy('item_section_order')
                ->get();

            $item_sections_after_location_map = $item->itemSections()
                ->where('item_section_position', ItemSection::POSITION_AFTER_LOCATION_MAP)
                ->where('item_section_status', ItemSection::STATUS_PUBLISHED)
                ->orderBy('item_section_order')
                ->get();

            $item_sections_after_features = $item->itemSections()
                ->where('item_section_position', ItemSection::POSITION_AFTER_FEATURES)
                ->where('item_section_status', ItemSection::STATUS_PUBLISHED)
                ->orderBy('item_section_order')
                ->get();

            $item_sections_after_reviews = $item->itemSections()
                ->where('item_section_position', ItemSection::POSITION_AFTER_REVIEWS)
                ->where('item_section_status', ItemSection::STATUS_PUBLISHED)
                ->orderBy('item_section_order')
                ->get();

            $item_sections_after_comments = $item->itemSections()
                ->where('item_section_position', ItemSection::POSITION_AFTER_COMMENTS)
                ->where('item_section_status', ItemSection::STATUS_PUBLISHED)
                ->orderBy('item_section_order')
                ->get();

select * from `themes` where `themes`.`id` = 1 limit 1
---
            /**
             * Start initial blade view file path
             */
            $theme_view_path = Theme::find($settings->setting_site_active_theme_id);

select `category_name`, `id`, `category_image`, `category_icon` from `categories` where `category_parent_id` is null and `locale` = 'ar' order by `category_name` asc
---
             * End initial Google reCAPTCHA version 2
             */
            // dd($item);
            $search_categories = Category::orderBy('category_name')
                ->whereNull('category_parent_id')
                ->select('category_name', 'id', 'category_image', 'category_icon')
                ->where('locale', app()->getLocale())
                ->get();

select * from `states` where `states`.`id` = 17 limit 1
select `id`, `city_name` from `cities` where `cities`.`state_id` = 17 and `cities`.`state_id` is not null order by `city_name` asc
---
    public function jsonGetCitiesByState(int $state_id)
    {
        $state = State::findOrFail($state_id);
        $cities = $state->cities()->select('id', 'city_name')->orderBy('city_name')->get()->toJson();

select * from `categories` where `categories`.`id` is null limit 1
select * from `categories` where `categories`.`id` in (842, 901, 1006, 1014, 1022, 1133, 1163)
select * from `cities` where `cities`.`id` in (1302, 1414, 1554, 1590, 1633, 1656, 1852)
select * from `states` where `states`.`id` in (42, 44, 48)
select *, LOCATE('h', item_title) as position from `items` where `items`.`item_title` like '%h%' order by `position` asc, `item_title` asc limit 8
select * from `categories` where `category_parent_id` = '64872'
---
    public function searchajax(Request $request)
    {
        $query1 = $request->input('query');
        $subCategory = Category::find($request->sub_category_id);
        $parentCategory = Category::find($request->category_id);
        // Perform the search query on your model
        $items = Item::query()->select('*')
            ->with('category.parent', 'state','city')
            ->selectRaw("LOCATE('$query1', item_title) as position")
            ->where('items.item_title', 'like', '%' . $query1 . '%')
            ->orderBy('position')->orderBy('item_title');
        if ($subCategory) {
            $items->where('category_id', $subCategory?->id);
        }
        if ($parentCategory) {
            $items->where('category_parent_id', $parentCategory?->id);
        }
        /* $cats = Category::query()->where(function ($query) use ($query1) {
             $query->where('category_name', 'LIKE', $query1 . "%");

         });*/

        return response()->json([
            'items' => $items->take(8)->get(),
//            'cats' => $cats->take(4)->get()
        ]);