app/Http/Controllers/UploadDataController.php

    public function update_title_desc()
    {

        $file = file_get_contents(storage_path('app/importer/metas_listing.json'));
        $objects = json_decode($file);
        $arr = [];
        foreach ($objects as $key => $object) {
            foreach ($object as $inner_key => $inner_object) {
                $word = $this->unifyArabicCharacters(trim($inner_key));
                $category = Category::where('category_name', $word)->first();
                if ($word)
                    Item::where('category_id', $category->id)
                        ->chunk(100, function ($items) use ($inner_object) {
                            foreach ($items as $item) {
                                $item->update([
                                    'meta_title' => str_replace('( brand name )', $item->item_title, $inner_object[0]),
                                    'meta_description' => str_replace(['( brand name )', '( الحي او المدينة)'], [$item->item_title, $item->city_city_name], $inner_object[1]),
                                ]);
                            }
                        });
---
select * from `categories` where `category_name` = 'كروت ذكيه' limit 1
select * from `items` where `category_id` = 297 order by `items`.`id` asc limit 100 offset 0
update `items` set `meta_title` = 'محل سمارت - تطبيقات الكروت الذكية لبيع كروت ذكية | تطبيق علاء الدين', `meta_description` = 'محل سمارت - تطبيقات الكروت الذكية لبيع كروت ذكية في  من خلال تطبيق علاء الدين حمل التطبيق الأن   ', `items`.`updated_at` = '2024-01-02 13:17:31' where `id` = 359328