app/Models/Advertisement.php

select * from `advertisements` where `advertisementable_id` = 3 and `advertisement_position` = 1 and `advertisement_status` = 1 order by `created_at` asc
select * from `advertisements` where `advertisementable_id` = 23 and `advertisement_position` = 1 and `advertisement_status` = 1 order by `created_at` asc
---
    public function fetchAdvertisements( $advertisement_place , int $advertisement_position, int $advertisement_status)
    {
        $ads = Advertisement::where('advertisementable_id', $advertisement_place)
            ->where('advertisement_position', $advertisement_position)
            ->where('advertisement_status', $advertisement_status)
            ->orderBy('created_at')
            ->get();
        if($ads->count() <= 0)
            $ads = Advertisement::where('advertisementable_id', 23)
                ->where('advertisement_position', $advertisement_position)
                ->where('advertisement_status', $advertisement_status)
                ->orderBy('created_at')
                ->get();