app/Models/Category.php

    public function getItemIdsByCategoryIds($category_id = null)
    {
        $item_ids = array();

        if($category_id)
        {
            $item_ids = DB::table('items')
                ->where('category_id', $category_id)
                ->distinct('id')
                ->pluck('id')
                ->toArray();
        }else{
            $item_ids = DB::table('items')
                ->where('category_id', $this->id)
                ->distinct('id')
                ->pluck('id')
                ->toArray();
---
select distinct `id` from `items` where `category_id` = 64901
select distinct `id` from `items` where `category_id` is null

    public function getPrintableCategoriesNoDash()
    {
        $printable_array = array();

        $root_categories = Category::where('category_parent_id', null)
            ->orderBy('category_name')
            ->get();
---
select * from `categories` where `category_parent_id` is null order by `category_name` asc