app/Models/Item.php

select * from `categories` where `categories`.`id` = 272 limit 1
select `categories`.*, `category_item`.`item_id` as `pivot_item_id`, `category_item`.`category_id` as `pivot_category_id`, `category_item`.`created_at` as `pivot_created_at`, `category_item`.`updated_at` as `pivot_updated_at` from `categories` inner join `category_item` on `categories`.`id` = `category_item`.`category_id` where `category_item`.`item_id` = 908179 and `category_item`.`category_id` in (189) order by `category_parent_id` asc limit 4
---
    public function getAllCategories($limit_rows=0, $parent_category=0)
    {
        $query_build = $this->allCategories();

        if($limit_rows > 0)
        {
            $query_build->limit($limit_rows);
        }

        if($parent_category > 0)
        {
            $parent_category = Category::findOrFail($parent_category);
            $children_categories_ids = array();
            $children_categories = collect();
            $parent_category->allChildren($parent_category, $children_categories);

            foreach($children_categories as $key => $children_category)
            {
                $children_categories_ids[] = $children_category->id;
            }

            if(count($children_categories_ids) > 0)
            {
                $query_build->whereIn('category_item.category_id', $children_categories_ids);
            }
        }

        $query_build->orderBy('category_parent_id');

        return $query_build->get();

select count(*) as aggregate from `reviews` where `approved` = 1 and `reviewrateable_id` = 908179
---
    public function getCountRating()
    {
        return DB::table('reviews')
            ->where('approved', self::ITEM_REVIEW_APPROVED)
            ->where('reviewrateable_id', $this->id)
            ->count();

select count(*) as aggregate from `reviews` where `approved` = 1 and `reviewrateable_id` = 908179 and `rating` = 1
---
    public function getStarsCountRating(int $stars)
    {
        return DB::table('reviews')
            ->where('approved', self::ITEM_REVIEW_APPROVED)
            ->where('reviewrateable_id', $this->id)
            ->where('rating', $stars)
            ->count();

select * from `reviews` where `approved` = 1 and `reviewrateable_id` = 908179 order by `updated_at` desc
---
    public function getApprovedRatingsSortBy(int $sort_by)
    {
        if($sort_by == self::ITEM_RATING_SORT_BY_NEWEST)
        {
            return DB::table('reviews')
                ->where('approved', self::ITEM_REVIEW_APPROVED)
                ->where('reviewrateable_id', $this->id)
                ->orderBy('updated_at', 'desc')
                ->get();

select count(*) as aggregate from `item_claims` where `item_claims`.`item_id` = 908179 and `item_claims`.`item_id` is not null and `item_claim_status` = 3
---
    public function hasClaimed()
    {
        return $this->claims()
            ->where('item_claim_status', ItemClaim::ITEM_CLAIM_STATUS_APPROVED)
            ->count();

select * from `item_hours` where `item_hours`.`item_id` = 908179 and `item_hours`.`item_id` is not null
---
    public function hasOpened()
    {
        $opening_hours_array_monday = array();
        $opening_hours_array_tuesday = array();
        $opening_hours_array_wednesday = array();
        $opening_hours_array_thursday = array();
        $opening_hours_array_friday = array();
        $opening_hours_array_saturday = array();
        $opening_hours_array_sunday = array();
        $opening_hour_exceptions_array = array();

        $item_hours = $this->itemHours()->get();

select * from `item_hour_exceptions` where `item_hour_exceptions`.`item_id` = 908179 and `item_hour_exceptions`.`item_id` is not null
---
            }
        }

        $item_hour_exceptions = $this->itemHourExceptions()->get();