app/Models/Subscription.php

select `u`.`id` from `subscriptions` inner join `users` as `u` on `subscriptions`.`user_id` = `u`.`id` where `u`.`email_verified_at` is not null and `u`.`user_suspended` = 0 and `subscriptions`.`subscription_end_date` is not null and `subscriptions`.`subscription_end_date` >= '2023-12-28'
---
    public function getPaidUserIds()
    {
        $today = new DateTime('now');
        $today = $today->format("Y-m-d");

        // get paid users id array
        $paid_user_ids = array();

        $paid_user_ids = Subscription::join('users as u', 'subscriptions.user_id', '=', 'u.id')
            ->where('u.email_verified_at', '!=', null)
            ->where('u.user_suspended', User::USER_NOT_SUSPENDED)
            ->where('subscriptions.subscription_end_date', '!=', null)
            ->where('subscriptions.subscription_end_date','>=', $today)
            ->pluck('u.id')
            ->toArray();

select `u`.`id` from `subscriptions` inner join `users` as `u` on `subscriptions`.`user_id` = `u`.`id` where `u`.`email_verified_at` is not null and `u`.`user_suspended` = 0
---
    public function getActiveUserIds()
    {
        $active_user_ids = array();

        $active_user_ids = Subscription::join('users as u', 'subscriptions.user_id', '=', 'u.id')
            ->where('u.email_verified_at', '!=', null)
            ->where('u.user_suspended', User::USER_NOT_SUSPENDED)
            ->pluck('u.id')
            ->toArray();