app/Http/Controllers/Admin/AdvertisementController.php

    public function create(Request $request)
    {
        $settings = app('site_global_settings');
        /**
         * Start SEO
         */
        SEOMeta::setTitle(__('advertisement.seo.create-ad', ['site_name' => empty($settings->setting_site_name) ? config('app.name', 'Laravel') : $settings->setting_site_name]));
        SEOMeta::setDescription('');
        SEOMeta::setCanonical(URL::current());
        SEOMeta::addKeyword($settings->setting_site_seo_home_keywords);
        /**
         * End SEO
         */
        $categories = Category::where('locale', app()->getLocale())
            ->whereNotNull('category_parent_id')
            ->orderBy('category_name', 'ASC')->get();
        $states = State::where('locale', app()->getLocale())
            ->orderBy('state_name', 'ASC')->get();
---
select * from `categories` where `locale` = 'ar' and `category_parent_id` is not null order by `category_name` asc
select * from `states` where `locale` = 'ar' order by `state_name` asc