app/Http/Controllers/Admin/CityController.php

    public function index(Request $request)
    {
        $settings = app('site_global_settings');

        /**
         * Start SEO
         */
        SEOMeta::setTitle(__('seo.backend.admin.city.cities', ['site_name' => empty($settings->setting_site_name) ? config('app.name', 'Laravel') : $settings->setting_site_name]));
        SEOMeta::setDescription('');
        SEOMeta::setCanonical(URL::current());
        SEOMeta::addKeyword($settings->setting_site_seo_home_keywords);
        /**
         * End SEO
         */

        $state_id = $request->state;

        if($state_id)
        {
            $state = State::findOrFail($state_id);
            $all_cities = $state->cities()->orderBy('city_name','asc')
                ->orderBy('city_name','desc')
                ->paginate(10);
        }
        else
        {
            $all_cities = City::orderBy('city_name','asc')
                ->paginate(10);
        }

        $all_states = collect();
        $all_countries = Country::orderBy('country_name')->get();

        foreach($all_countries as $key => $country)
        {
            $states = $country->states()->orderBy('state_name')->get();
---
select * from `cities` order by `city_name` desc limit 10 offset 0
select count(*) as aggregate from `cities`
select * from `countries` order by `country_name` asc
select * from `states` where `states`.`country_id` = 1 and `states`.`country_id` is not null order by `state_name` asc

    public function create()
    {
        $settings = app('site_global_settings');

        /**
         * Start SEO
         */
        SEOMeta::setTitle(__('seo.backend.admin.city.create-city', ['site_name' => empty($settings->setting_site_name) ? config('app.name', 'Laravel') : $settings->setting_site_name]));
        SEOMeta::setDescription('');
        SEOMeta::setCanonical(URL::current());
        SEOMeta::addKeyword($settings->setting_site_seo_home_keywords);
        /**
         * End SEO
         */

        $all_states = collect();
        $all_countries = Country::orderBy('country_name')->get();

        foreach($all_countries as $key => $country)
        {
            $states = $country->states()
                ->where('locale',app()->getLocale())
                ->orderBy('state_name')->get();
---
select * from `countries` order by `country_name` asc
select * from `states` where `states`.`country_id` = 1 and `states`.`country_id` is not null and `locale` = 'ar' order by `state_name` asc