app/Http/Controllers/Admin/ItemController.php

update `items` set `category_id` = '189', `items`.`updated_at` = '2023-12-28 12:33:08' where `id` = 908179
---
    public function updateItemCategory(Request $request, Item $item)
    {
        $request->validate([
            'category' => 'required',
            'category.*' => 'numeric',
        ]);

        // validate category_ids
        $select_categories = $request->category;

        $item_categories_string = "";

        /*foreach($select_categories as $key => $select_category)
        {
            $select_category = Category::find($select_category);
            if(!$select_category)
            {
                throw ValidationException::withMessages(
                    [
                        'category' => 'Category not found',
                    ]);
            }
            else
            {
                $item_categories_string = $item_categories_string . " " . $select_category->category_name;
            }
        }*/
        // update item category
        $item->update(['category_id' => $select_categories]);

select * from `states` where `states`.`id` = '41' limit 1
---
//            }

            // validate state_id
            $select_state = State::find($request->state_id);

select * from `cities` where `cities`.`id` = '1619' limit 1
---
//            }
            // validate city_id

            $select_city = City::find($request->city_id);

update `items` set `item_featured` = 0, `item_featured_by_admin` = 0, `item_lat` = '', `item_lng` = '', `items`.`updated_at` = '2023-12-27 13:41:45' where `id` = 908174
delete from `item_phones` where `item_phones`.`item_id` = 908174 and `item_phones`.`item_id` is not null
---
        $item->canonical = $request->canonical;


        $item->save();

        $item->itemPhones()->delete();

delete from `item_features` where `item_features`.`item_id` = 908174 and `item_features`.`item_id` is not null order by `id` asc
---
        }

        // start to save custom fields data
        $item->features()->delete();